{
  "main": {
    "name": "Cindy Leung",
    "occupation": "senior computer science student at CSULB",
    "description": "I like to put in the time to figure things out and learn interesting things!",
    "profile1": "./images/profile1.jpeg",
    "profile2": "./images/profile2.jpeg",
    "bio1": "Mrs. Cindy received her bachelor’s degree in Piano Performance at the Bob Cole Conservatory of Music at California State University, Long Beach. She started the piano at age 10 under the tutelage of Mrs. Lily Kwok and since then has been part of the Music Teachers Association of California (MTAC) program from a student to now a teacher. During her time at CSULB, she studied under the tutelage of Ms. Chizuko Asada and played in masterclasses with renowned concert pianist Robert Thies. Cindy began teaching privately in 2016 by going to student’s homes and her studio has grown immensely. She has experience teaching students of all ages and caters lessons to each student’s personality and way of learning. Cindy currently teaches piano lessons in her home, using a Yamaha C3 grand piano.",
    "bio2": "Mrs. Cindy continued her education at California State University, Northridge where she pursed a secondary degree in Music Therapy, studying under Ron Borczon, MT-BC and Helen Dolas, MT-BC. During her time at CSUN, Mrs. Cindy provided music therapy services to adults with developmental disabilities, children in a school setting, geriatrics population, as well as patients in an outpatient hospital setting. She completed her clinical internship at Metropolitan State Hospital, where she developed innovative and creative music therapy interventions for the forensic psychiatric population. Mrs. Cindy is now a board-certified music therapist working at Metro’s sister hospital Patton State Hospital, where she continues to use music as a therapeutic tool to meet the needs of her patients and ultimately improving their quality of life. She recently developed an a capella group at the hospital called “Patton-tonix” (inspired by <i>Pentatonix<i/>), consisting of her music therapist colleagues. Her ultimate vision of this group is to adapt “Patton-tonix” into daily patient treatment care, providing treatment for the patients in a fun and creative way.",
    "bio3": "Mrs. Cindy is also an experienced musician with a demonstrated history of working in the religious institutions industry. As the age of 6, she was part of the Chinatown Children’s Choir at the Chinese United Methodist Church and after graduating high school would return as an alumna to volunteer as the piano accompanist and choir assistant. She also composed flute arrangements and performed them during the choir’s annual concerts. Mrs. Cindy started as a volunteer worship leader at the First United Methodist Church of San Gabriel, where she led the worship team while accompanying with either the piano, guitar, bass guitar, or drums. Mrs.Cindy is now the pianist/organist and worship leader at the Calvary Presbyterian Church, where she provides music throughout the service. Mrs. Cindy is also the co-founder and pianist of Bow Tie Tunes, a dynamic string trio specialized in providing live instrumental music to special occasions such as weddings, celebrations of life, and more.",
    "bio4": "Aside from her musical life, Mrs. Cindy is a veteran, having served in the Army Reserves for 8 years. She endured hardship throughout basic training and was chosen to be promoted amongst her peers. She eventually promoted to Sergeant (E-5) and was tasked various leadership roles throughout her military career. The Army has taught Mrs. Cindy both leadership and life skills that she continues to carry with her into her civilian life. One of the things Mrs. Cindy misses most about being in the Army is having the opportunity to travel to different places such as South Carolina, Virginia, Georgia, and Hawaii.",
    "bio5": "All of Mrs. Cindy’s experiences, whether being a musician, a music therapist, a soldier, a student, or even a teacher, has shaped her into the person she is now. Mrs. Cindy strongly believes in the importance of finding one’s own passion and strives to helping her students learn and fall in love with music. Mrs. Cindy understands that every student is unique in their own way and learns differently. She will tailor each lesson and create a positive learning environment for all her students!",
    "contactmessage": "",
    "email": "",
    "social": [
      {
        "name": "linkedin",
        "url": "",
        "className": "fab fa-linkedin"
      },
      {
        "name": "github",
        "url": "",
        "className": "fab fa-github"
      }
    ]
  },
  "reviews": [
    {
      "from": "Janna (parent)",
      "content": "Cindy is a great teacher. She has been giving lessons for my daughter for 4 years and has been amazing to work. Within a few months of working with Cindy, she started practicing regularly on her own. She started enjoying it ever since, and is now part of her daily routine. I'm really happy we found Cindy and will continue to recommend her."
    },
    {
      "from": "Madelyn (student)",
        "content": "Ever since I had been working with Cindy, my intonation, literature, musicality, and techniques have improved a lot. Not only it helped in piano, but it helped me excel a lot faster in the other instruments I was learning. Out of all the piano teachers I had, she became more involved and helped me improve my skills in many places that needed it. In my opinion, I feel like I have progressed so much with Cindy in an amount of 4 years that no other teacher could have. It was a great time being her student."
    },
    {
      "from": "Laura (adult student)",
      "content": "Cindy is a great piano instructor whose very patient, motivational and inspiring. I started playing the piano in middle school. I took a long break from piano because of college and working. I decided to go back to playing as an adult. I was very nervous of not being able to remember what I once learned. I began lessons with Cindy and she was so encouraging and positive. She has a special gift in music and in teaching it to others.Cindy is extremely professional, talented, and responsive. I would certainly recommend her as a piano instructor to any one who has always wanted to learn the piano."
    },
    {
      "from": "Dahlia (parent)",
      "content": "Cindy is a wonderful piano instructor. My daughter started piano lessons with her since 2017. She revived in her the love and eagerness to play the piano again to the extent that she couldn't wait for the piano lesson every week. Years passed and Cindy proved to be quite patient, flexible, and motivational."
    },
    {
      "from": "Cinthya (parent)",
      "content": "Cindy has been a wonderful teacher for my 6 year old. She is engaging and patient and my daughter has learned so much! I would highly recommend Cindy to anyone who is looking for a piano teacher!"
    },
    {
      "from": "Michael (parent)",
      "content": "Cindy is super patient and a wonderful piano instructor. My daughter has been taking her classes for the past year and the progress she made was amazing, especially considering majority of her classes were remote due to covid situation. I would highly recommend Ms Cindy to other parents."
    },
    {
      "from": "Luis (parent)",
      "content": "I can't say enough about how amazing Cindy has been with my eight year old boy. She takes her time to explain everything about the pianos functionality, reading musical notes and makes logic recommendation on which music books to purchase. He has express how much better he plays the piano on his spare time and is looking to learn the complete Fur Elise song with the help of Cindy. I highly recommend her :)"
    }
  ],
  "resume": {
    "education": [
      {
        "school": "",
        "degree": "",
        "years": "",
        "description": ""
      }
    ],
    "work": [
      {
        "company": "",
        "title": "",
        "years": "",
        "description": ""
      }
    ],
    "skills": [
      {
        "name": "Git",
        "level": "80%"
      },
      {
        "name": "SQL (MySQL, PostgreSQL)",
        "level": "85%"
      },
      {
        "name": "NoSQL (MongoDB)",
        "level": "70%"
      },
      {
        "name": "Python",
        "level": "90%"
      },
      {
        "name": "Java",
        "level": "90%"
      },
      {
        "name": "C++",
        "level": "70%"
      },
      {
        "name": "Angular",
        "level": "80%"
      },
      {
        "name": "ReactJS",
        "level": "70%"
      },
      {
        "name": "Node JS, Express JS",
        "level": "80%"
      },
      {
        "name": "DJango",
        "level": "75%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "TBA",
        "category": "TBA",
        "image": "TBA",
        "url": "TBA"
      }
    ]
  }
}
